### Assignment 2 (22nd August 2022, Monday)

#### Initializing Connection

In [ ]:
import mysql.connector as sqltor

connection = sqltor.connect(host="localhost", user="root", password="mysqlpasswd")
cursor = connection.cursor()
cursor.execute("CREATE DATABASE IF NOT EXISTS week2")
cursor.execute("USE week2")

#### Additional Helper functions

In [ ]:
def disp():
    print(*[line for line in cursor], sep="\n")


def run(query: str):
    cursor.execute(query)

#### Testing Tables and Databases

In [ ]:
run("SHOW DATABASES")
disp()
run("SHOW TABLES")
disp()
# exit()

#### Queries

##### 1. Create a table employee with attributes emp_id, f_name, l_name, job_type, salary, dept, commission, manager_id.

In [ ]:
run(
    """CREATE TABLE Employee (
				emp_id INT(4),
				f_name VARCHAR(25),
				l_name VARCHAR(25),
				job_type VARCHAR(10),
				salary INT(10),
				dept VARCHAR(10),
				commission INT(10),
				manager_id VARCHAR(5)
			)
"""
)
query1a = "ALTER TABLE Employee DROP PRIMARY KEY"

|      Field      |    Type     | Null | Key | Default | Extra |
| :-------------: | :---------: | :--: | :-: | :-----: | :---: |
|     emp_id      |     int     | YES  |     |  NULL   |       |
|     f_name      | varchar(25) | YES  |     |  NULL   |       |
|     l_name      | varchar(25) | YES  |     |  NULL   |       |
|    job_type     | varchar(10) | YES  |     |  NULL   |       |
|     salary      |     int     | YES  |     |  NULL   |       |
|      dept       | varchar(10) | YES  |     |  NULL   |       |
|   commission    |     int     | YES  |     |  NULL   |       |
|   manager_id    | varchar(5)  | YES  |     |  NULL   |       |
| date_of_joining |    date     | YES  |     |  NULL   |       |

##### 2. Make emp_id as the primary key of employee table.

In [ ]:
run("ALTER TABLE Employee ADD PRIMARY KEY(emp_id)")

|   Field    |    Type     | Null | Key | Default | Extra |
| :--------: | :---------: | :--: | :-: | :-----: | :---: |
|   emp_id   |     int     |  NO  | PRI |  NULL   |       |
|   f_name   | varchar(25) | YES  |     |  NULL   |       |
|   l_name   | varchar(25) | YES  |     |  NULL   |       |
|  job_type  | varchar(10) | YES  |     |  NULL   |       |
|   salary   |     int     | YES  |     |  NULL   |       |
|    dept    | varchar(10) | YES  |     |  NULL   |       |
| commission |     int     | YES  |     |  NULL   |       |
| manager_id | varchar(5)  | YES  |     |  NULL   |       |

##### 3. Make f_name and salary NOT NULL type.

In [ ]:
run(
    """ALTER TABLE Employee 
				MODIFY f_name VARCHAR(25) NOT NULL,
				MODIFY salary INT(10) NOT NULL
"""
)

|   Field    |    Type     | Null | Key | Default | Extra |
| :--------: | :---------: | :--: | :-: | :-----: | :---: |
|   emp_id   |     int     |  NO  | PRI |  NULL   |       |
|   f_name   | varchar(25) |  NO  |     |  NULL   |       |
|   l_name   | varchar(25) | YES  |     |  NULL   |       |
|  job_type  | varchar(10) | YES  |     |  NULL   |       |
|   salary   |     int     |  NO  |     |  NULL   |       |
|    dept    | varchar(10) | YES  |     |  NULL   |       |
| commission |     int     | YES  |     |  NULL   |       |
| manager_id | varchar(5)  | YES  |     |  NULL   |       |

##### 4. Add a column date_of_joining in the employee table.

In [ ]:
run("""ALTER TABLE Employee ADD date_of_joining DATE""")

|      Field      |    Type     | Null | Key | Default | Extra |
| :-------------: | :---------: | :--: | :-: | :-----: | :---: |
|     emp_id      |     int     |  NO  | PRI |  NULL   |       |
|     f_name      | varchar(25) |  NO  |     |  NULL   |       |
|     l_name      | varchar(25) | YES  |     |  NULL   |       |
|    job_type     | varchar(10) | YES  |     |  NULL   |       |
|     salary      |     int     |  NO  |     |  NULL   |       |
|      dept       | varchar(10) | YES  |     |  NULL   |       |
|   commission    |     int     | YES  |     |  NULL   |       |
|   manager_id    | varchar(5)  | YES  |     |  NULL   |       |
| date_of_joining |    date     | YES  |     |  NULL   |       |

##### 5. Create a table department with attribute d_name, d_loc and HOD_id where d_name is primary key.

In [ ]:
run(
    """CREATE TABLE Department (
				d_name VARCHAR(10) PRIMARY KEY,
				d_loc VARCHAR(10),
				HOD_id VARCHAR(10)
			)
"""
)

| Field  |    Type     | Null | Key | Default | Extra |
| :----: | :---------: | :--: | :-: | :-----: | :---: |
| d_name | varchar(10) |  NO  | PRI |  NULL   |       |
| d_loc  | varchar(10) | YES  |     |  NULL   |       |
| HOD_id | varchar(10) | YES  |     |  NULL   |       |

##### 6. Create a table location with attributes loc_id, city and contact_no.

In [ ]:
run(
    """CREATE TABLE Location (
				loc_id VARCHAR(10),
				city VARCHAR(20),
				contact_no INT(12)
			)
"""
)

|   Field    |    Type     | Null | Key | Default | Extra |
| :--------: | :---------: | :--: | :-: | :-----: | :---: |
|   loc_id   | varchar(10) | YES  |     |  NULL   |       |
|    city    | varchar(20) | YES  |     |  NULL   |       |
| contact_no |     int     | YES  |     |  NULL   |       |

##### 7. Enhance the size of the ‘city’ attribute by 5, in the location table.

In [ ]:
run("ALTER TABLE Location MODIFY city VARCHAR(25)")

|   Field    |    Type     | Null | Key | Default | Extra |
| :--------: | :---------: | :--: | :-: | :-----: | :---: |
|   loc_id   | varchar(10) | YES  |     |  NULL   |       |
|    city    | varchar(25) | YES  |     |  NULL   |       |
| contact_no |     int     | YES  |     |  NULL   |       |

##### 8. Delete the contact_no attribute from the location table.

In [ ]:
run("ALTER TABLE Location DROP contact_no")

| Field  |    Type     | Null | Key | Default | Extra |
| :----: | :---------: | :--: | :-: | :-----: | :---: |
| loc_id | varchar(10) | YES  |     |  NULL   |       |
|  city  | varchar(25) | YES  |     |  NULL   |       |

##### 9. Make the department attribute of the employee table its foreign key referencing the department table.

In [ ]:
run(
    """ALTER TABLE Employee ADD FOREIGN KEY (dept)
		   REFERENCES Department(d_name)
"""
)

|      Field      |    Type     | Null | Key | Default | Extra |
| :-------------: | :---------: | :--: | :-: | :-----: | :---: |
|     emp_id      |     int     |  NO  | PRI |  NULL   |       |
|     f_name      | varchar(25) |  NO  |     |  NULL   |       |
|     l_name      | varchar(25) | YES  |     |  NULL   |       |
|    job_type     | varchar(10) | YES  |     |  NULL   |       |
|     salary      |     int     |  NO  |     |  NULL   |       |
|      dept       | varchar(10) | YES  | MUL |  NULL   |       |
|   commission    |     int     | YES  |     |  NULL   |       |
|   manager_id    | varchar(5)  | YES  |     |  NULL   |       |
| date_of_joining |    date     | YES  |     |  NULL   |       |
| date_of_joining |    date     | YES  |     |  NULL   |       |

##### 10. Rename the city attribute to ‘address’ in the location table.

In [ ]:
run("ALTER TABLE Location RENAME COLUMN city TO address")

|  Field  |    Type     | Null | Key | Default | Extra |
| :-----: | :---------: | :--: | :-: | :-----: | :---: |
| loc_id  | varchar(10) | YES  |     |  NULL   |       |
| address | varchar(25) | YES  |     |  NULL   |       |

##### 11. Rename the location table name to ‘loc’.

In [ ]:
run("RENAME TABLE Location TO Loc")

##### 12. Insert the following rows in ‘loc’ table.

In [ ]:
run(
    """INSERT INTO Loc VALUES
				(1, 'Kolkata'),
				(2, 'Mumbai')
"""
)
connection.commit()

| loc_id | address |
| :----: | :-----: |
|   1    | Kolkata |
|   2    | Mumbai  |

##### 13. Truncate the table ‘loc’.

In [ ]:
run("TRUNCATE TABLE Loc")

| loc_id | address |
| :----: | :-----: |

##### 14. Drop the table ‘loc’.

In [ ]:
run("DROP TABLE Loc")

##### 15. Insert the following rows in the department table:

In [ ]:
run(
    """INSERT INTO Department VALUES
				('Sales', 'Kol', 4),
				('Accounts', 'Delhi', 6),
				('Production', 'Kol', 1),
				('Marketing', 'Kol', 2),
				('R & D', 'Marketing', 8)

"""
)

|   d_name   |   d_loc   | HOD_id |
| :--------: | :-------: | :----: |
|  Accounts  |   Delhi   |   6    |
| Marketing  |    Kol    |   2    |
| Production |    Kol    |   1    |
|   R & D    | Marketing |   8    |
|   Sales    |    Kol    |   4    |

##### 16. Insert the following rows in the employee table.

In [ ]:
run(
    """INSERT INTO Employee (emp_id, f_name, l_name, job_type, salary, commission, dept, manager_id, date_of_joining) VALUES
			(1, 'Arun', 'Khan', 'Manager', 90000, 0, 'Production', NULL, '1998-01-04'),
			(2, 'Barun', 'Kumar', 'Manager', 80000, 0, 'Marketing', NULL, '1998-02-09'),
			(3, 'Chitra', 'Kapoor', 'Engineer', 60000, 0, 'Production', 1, '1998-01-08'),
			(10, 'Sunny', 'Deol', 'Salesman', 35000, 0, 'R & D', 8, '2017-10-17')

"""
)
connection.commit()

| emp_id | f_name | l_name | job_type | salary |    dept    | commission | manager_id | date_of_joining |
| :----: | :----: | :----: | :------: | :----: | :--------: | :--------: | :--------: | :-------------: |
|   1    |  Arun  |  Khan  | Manager  | 90000  | Production |     0      |    NULL    |   1998-01-04    |
|   2    | Barun  | Kumar  | Manager  | 80000  | Marketing  |     0      |    NULL    |   1998-02-09    |
|   3    | Chitra | Kapoor | Engineer | 60000  | Production |     0      |     1      |   1998-01-08    |
|   10   | Sunny  |  Deol  | Salesman | 35000  |   R & D    |     0      |     8      |   2017-10-17    |

##### 17. Show the values of departmental table.

In [ ]:
run("SELECT * FROM Department")
disp()

|   d_name   |   d_loc   | HOD_id |
| :--------: | :-------: | :----: |
|  Accounts  |   Delhi   |   6    |
| Marketing  |    Kol    |   2    |
| Production |    Kol    |   1    |
|   R & D    | Marketing |   8    |
|   Sales    |    Kol    |   4    |

##### 18. Select the department names and their locations.

In [ ]:
run("SELECT d_name AS Name, d_loc AS Location FROM Department")
disp()

|    Name    | Location  |
| :--------: | :-------: |
|  Accounts  |   Delhi   |
| Marketing  |    Kol    |
| Production |    Kol    |
|   R & D    | Marketing |
|   Sales    |    Kol    |

##### 19. Show the employees f_name , l_name , salary and the salary after 1000rs. Bonus.

In [ ]:
run("SELECT f_name, l_name, salary, salary + 1000 AS 'Bonus Salary' FROM Employee")
disp()

| f_name | l_name | salary | Bonus Salary |
| :----------: | :----------: | :----------: | :----------: |
| Arun   | Khan   |  90000 |        91000 |
| Barun  | Kumar  |  80000 |        81000 |
| Chitra | Kapoor |  60000 |        61000 |
| Sunny  | Deol   |  35000 |        36000 |

##### 20. Show the employees annual salary with a 1000rs. Yearly bonus and the annual salary with a 100rs. Monthly bonus.

In [ ]:
run("SELECT (salary + 100) * 12 + 1000 AS 'Annual Salary' FROM Employee")
disp()

| Annual Salary |
| :-----------: |
|    1082200    |
|    962200     |
|    722200     |
|    422200     |

##### 21. Show f_name as NAME and annual salary as ANNSAL from the employee table.

In [ ]:
run("SELECT f_name AS NAME, salary * 12 AS ANNSAL from Employee")
disp()

|  NAME  | ANNSAL  |
| :----: | :-----: |
|  Arun  | 1080000 |
| Barun  | 960000  |
| Chitra | 720000  |
| Sunny  | 420000  |

##### 22. Show the l_name as LasT AND 100rs. Incremented salary as NewSal.

In [ ]:
run("SELECT l_name AS LasT, salary + 100 AS NewSal FROM Employee")
disp()

|  LasT  | NewSal |
| :----: | :----: |
|  Khan  | 90100  |
| Kumar  | 80100  |
| Kapoor | 60100  |
|  Deol  | 35100  |

##### 23. Show the emp_id, f_name, l_name, job_type of the employee getting highest salary.

In [ ]:
run(
    """SELECT emp_id, f_name, l_name, job_type FROM Employee 
    WHERE salary = (SELECT MAX(salary) FROM Employee)
"""
)
disp()

| emp_id | f_name | l_name | job_type |
| :----: | :----: | :----: | :------: |
|   1    |  Arun  |  Khan  | Manager  |

##### 24. Show the emp_id, f_name, l_name, job_type of the employee getting minimum salary.

In [ ]:
run(
    """SELECT emp_id, f_name, l_name, job_type FROM Employee 
       WHERE salary = (SELECT MIN(salary) FROM Employee)
"""
)
disp()

| emp_id | f_name | l_name | job_type |
| :----: | :----: | :----: | :------: |
|   10   | Sunny  |  Deol  | Salesman |

##### 25. Show the average salary of employees in the employee table.

In [ ]:
run("SELECT AVG(salary) AS 'Average Salary' FROM Employee")
disp()

| Average Salary |
| :------------: |
|   66250.0000   |

##### 26. Consider the Insurance database given below. The primary keys are underlined and the data types are specified:
    -   PERSON (driver-id: string, name: string, address: string)
    -   CAR (Regno:string,model:string,year:int)
    -   ACCIDENT (report-number:int,date:date,location:string)
    -   OWNS (driver-id:string,regno:string)
    -   PARTICIPATED (driver-id:string,regno:string,report-number:int,damage-amount:int)

i. Create the above tables by properly specifying the primary keys and the foreign keys

In [ ]:
run(
    """CREATE TABLE PERSON (
                driver_id VARCHAR(10),
                name VARCHAR(25),
                address VARCHAR(100)
            )
"""
)

|   Field   |     Type     | Null | Key | Default | Extra |
| :-------: | :----------: | :--: | :-: | :-----: | :---: |
| driver_id | varchar(10)  | YES  |     |  NULL   |       |
|   name    | varchar(25)  | YES  |     |  NULL   |       |
|  address  | varchar(100) | YES  |     |  NULL   |       |

In [ ]:
run(
    """CREATE TABLE CAR (
                Regno VARCHAR(10),
                model VARCHAR(25),
                year INT(4)
            )
"""
)

| Field |    Type     | Null | Key | Default | Extra |
| :---: | :---------: | :--: | :-: | :-----: | :---: |
| Regno | varchar(10) | YES  |     |  NULL   |       |
| model | varchar(25) | YES  |     |  NULL   |       |
| year  |     int     | YES  |     |  NULL   |       |

In [ ]:
run(
    """CREATE TABLE ACCIDENT (
                report_number INT(3),
                date DATE,
                location VARCHAR(100)
            )
"""
)

|     Field     |     Type     | Null | Key | Default | Extra |
| :-----------: | :----------: | :--: | :-: | :-----: | :---: |
| report_number |     int      | YES  |     |  NULL   |       |
|     date      |     date     | YES  |     |  NULL   |       |
|   location    | varchar(100) | YES  |     |  NULL   |       |

In [ ]:
run(
    """CREATE TABLE OWNS (
                driver_id VARCHAR(10),
                regno VARCHAR(10)
            )
"""
)

|   Field   |    Type     | Null | Key | Default | Extra |
| :-------: | :---------: | :--: | :-: | :-----: | :---: |
| driver_id | varchar(10) | YES  |     |  NULL   |       |
|   regno   | varchar(10) | YES  |     |  NULL   |       |

In [ ]:
run(
    """CREATE TABLE PARTICIPATED (
                driver_id VARCHAR(10),
                regno VARCHAR(10),
                reportno INT(3),
                damage_amount INT
            )
"""
)

|     Field     |    Type     | Null | Key | Default | Extra |
| :-----------: | :---------: | :--: | :-: | :-----: | :---: |
|   driver_id   | varchar(10) | YES  |     |  NULL   |       |
|     regno     | varchar(10) | YES  |     |  NULL   |       |
|   reportno    |     int     | YES  |     |  NULL   |       |
| damage_amount |     int     | YES  |     |  NULL   |       |

ADDING PRIMARY KEYS TO TABLES

In [ ]:
run("ALTER TABLE PERSON ADD PRIMARY KEY(driver_id)")
run("ALTER TABLE CAR ADD PRIMARY KEY(Regno)")
run("ALTER TABLE ACCIDENT ADD PRIMARY KEY(report_number)")

ADDING FOREIGN KEYS TO TABLES

In [ ]:
run(
    """ALTER TABLE OWNS 
           ADD FOREIGN KEY (driver_id) REFERENCES PERSON(driver_id),
           ADD FOREIGN KEY (regno) REFERENCES CAR(Regno)
"""
)
run(
    """ALTER TABLE PARTICIPATED
           ADD FOREIGN KEY (driver_id) REFERENCES PERSON(driver_id),
           ADD FOREIGN KEY (regno) REFERENCES CAR(Regno),
           ADD FOREIGN KEY (reportno) REFERENCES ACCIDENT(report_number)
    """
)

ii. Enter atleast five tuples for each relation

In [ ]:
run(
    """INSERT INTO PERSON VALUES
            (1, "ARUN SEN", "127 B ROAD. ND"),
            (2, "RAHUL ROY", "32 CIVIL LINES"),
            (3, "SUSHMITA DAS", "14 CALIBER RD"),
            (4, "VIJAY RAO", "133rd street ABQ"),
            (5, "ARIANA SEN", "12th Avenue ONE skyrise")
    """
)

| driver_id | name         | address                 |
| :-------- | :----------- | :---------------------- |
| 1         | ARUN SEN     | 127 B ROAD. ND          |
| 2         | RAHUL ROY    | 32 CIVIL LINES          |
| 3         | SUSHMITA DAS | 14 CALIBER RD           |
| 4         | VIJAY RAO    | 133rd street ABQ        |
| 5         | ARIANA SEN   | 12th Avenue ONE skyrise |

In [ ]:
run(
    """INSERT INTO CAR VALUES
            (1, "HYUNDAI VERNA", 2007),
            (2, "RENAULT SCALA", 2009),
            (3, "TATA TIGOR", 2018),
            (4, "MARUTI SX4", 2014),
            (5, "MAHINDRA SCORPIO", 2020)
    """
)

| Regno | model            | year |
| :---- | :--------------- | :--: |
| 1     | HYUNDAI VERNA    | 2007 |
| 2     | RENAULT SCALA    | 2009 |
| 3     | TATA TIGOR       | 2018 |
| 4     | MARUTI SX4       | 2014 |
| 5     | MAHINDRA SCORPIO | 2020 |

In [ ]:
run(
    """INSERT INTO ACCIDENT VALUES
        (1, '2017-02-17', "NH 13"),
        (2, '2018-08-25', "BT Road"),
        (3, '2019-01-16', "13th MG Road"),
        (4, '2020-12-03', "Alibagh Railway Crossing"),
        (5, '2021-11-05', "Scranton, Public Park")
    """
)
connection.commit()

| report_number |    date    | LOCATION                 |
| ------------: | :--------: | :----------------------- |
|             1 | 2017-02-17 | NH 13                    |
|             2 | 2018-08-25 | BT Road                  |
|             3 | 2019-01-16 | 13th MG Road             |
|             4 | 2020-12-03 | Alibagh Railway Crossing |
|             5 | 2021-11-05 | Scranton, Public Park    |

In [ ]:
run(
    """
    INSERT INTO OWNS VALUES
        (1, 3),
        (2, 5),
        (3, 1),
        (4, 2),
        (5, 4)
"""
)
connection.commit()

| driver_id | regno |
| :-------- | :---- |
| 1         | 3     |
| 2         | 5     |
| 3         | 1     |
| 4         | 2     |
| 5         | 4     |

In [ ]:
run(
    """
    INSERT INTO PARTICIPATED VALUES
        (2, 5, 1, 2000),
        (3, 1, 2, 3000),
        (2, 5, 3, 14000),
        (5, 4, 4, 1000),
        (1, 3, 5, 20000)
"""
)

| driver_id | regno | reportno | damage_amount |
| :-------: | :---: | :------: | :-----------: |
|     2     |   5   |    1     |     2000      |
|     3     |   1   |    2     |     3000      |
|     2     |   5   |    3     |     14000     |
|     5     |   4   |    4     |     1000      |
|     1     |   3   |    5     |     20000     |

iii. Demonstrate how you:  
 a. Update the damage amount for the car with a specific regno in accident with report number 12 to 25000.  
 b. Add a new accident to the database.

In [ ]:
run(
    """
        UPDATE PARTICIPATED SET damage_amount = 25000 
        WHERE regno=5 AND reportno=1
    """
)
connection.commit()

| driver_id | regno | reportno | damage_amount |
| :-------: | :---: | :------: | :-----------: |
|     2     |   5   |    1     |     25000     |
|     3     |   1   |    2     |     3000      |
|     2     |   5   |    3     |     14000     |
|     5     |   4   |    4     |     1000      |
|     1     |   3   |    5     |     20000     |

In [ ]:
run(
    """
    INSERT INTO ACCIDENT VALUES
        (6, '2006-10-17', "EM Bypass, Kolkata")
"""
)
connection.commit()

| report_number |    date    | LOCATION                 |
| ------------: | :--------: | :----------------------- |
|             1 | 2017-02-17 | NH 13                    |
|             2 | 2018-08-25 | BT Road                  |
|             3 | 2019-01-16 | 13th MG Road             |
|             4 | 2020-12-03 | Alibagh Railway Crossing |
|             5 | 2021-11-05 | Scranton, Public Park    |
|             6 | 2006-10-17 | EM Bypass, Kolkata       |

iv. Find the total number of people who owned cars that were involved in accidents in 2006.

In [ ]:
run("SELECT COUNT(*) AS ACCIDENTS FROM ACCIDENT WHERE DATE LIKE '2006%'")
disp()

| ACCIDENTS |
|-----------:|
|         1 |

v. Find the number of accidents in which cars belonging to a specific model were involved.

In [ ]:
model="SCORPIO"

run(f"""
    SELECT COUNT(*) AS 'NUMBER OF ACCIDENTS' 
    FROM CAR NATURAL JOIN (
        SELECT * FROM ACCIDENT, PARTICIPATED 
        WHERE reportno=report_number
    ) AS _ WHERE model LIKE "%{model}%";
""")
disp()

| NUMBER OF ACCIDENTS |
|--------------------:|
|                   2 |